<?php

use yii\db\Migration;

/**
 * Class m210205_060419_change_part
 */
class m210205_060419_change_part extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->delete('{{%part}}');
        
        $this->batchInsert('{{%part}}',
            ['name', 'level', 'weight'],
            [
                ['Проблематика', 1, 3],
                ['География', 1, 2],
                ['Цель проекта', 1, 2],
                ['Основные задачи', 1, 2],

                ['Маркетинговый анализ', 2, 2],
                ['Целевая аудитория', 2, 1],

                ['Экономический анализ', 2, 2],
                ['Финансовый анализ', 2, 2],
                ['Финансовое моделирование', 2, 2],

                ['Календарный план', 2, 3],
                ['Необходимые ресурсы', 2, 2],

                ['Команда проекта', 2, 2],
                ['Партнеры', 2, 1],

                ['Конкуренты', 2, 1],
                ['Конкурентные преимущества', 2, 2],

                ['Результаты проекта', 2, 3],
                ['Методы оценок результатов', 2, 1],
                ['Социальный эффект', 2, 1],

                ['Дальнейшее развитие проекта', 3, 1],
                ['Презентация', 3, 3],


            ]
        );
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->batchInsert('{{%part}}',
            ['name', 'level', 'weight'],
            [
                ['Актуальный статус продукта', 1, 3],
                ['Определение продукта', 1, 3],
                ['Технологии', 1, 1],
                ['Ключевые потребители', 2, 1],
                ['Конкурентные преимущества', 2, 1],
                ['Планы', 2, 1],
                ['Команда проекта', 2, 1],
                ['Необходимые ресурсы', 2, 1],
                ['Презентация', 3, 3],
            ]
        );
    }
}
